app/views/marks/_form.html.erb

SELECT "aspirants".* FROM "aspirants"
---
    <%= f.label :aspirant_id %><br />
    <%= f.select :aspirant_id, Aspirant.all.map{|s| [s.first_name.to_s + " " + s.second_name.to_s + "" + s.last_name.to_s, s.id]} %>