app/views/marks/_form.html.erb

    <%= f.label :subject_id %><br />
    <%= f.select :subject_id, Subject.all.map{|s| [s.name.to_s, s.id]} %>
---
SELECT "subjects".* FROM "subjects"