app/views/aspirants/_form.html.erb

    <%= f.label :specialiti_id %><br />
    <%= f.select :specialiti_id, Speciality.all.map{ |s| [s.name, s.id]} %>
---
SELECT "specialities".* FROM "specialities"