app/controllers/aspirants_controller.rb

  def index
    @aspirants = Aspirant.all
---
SELECT "aspirants".* FROM "aspirants"

  def show
    @aspirant = Aspirant.find(params[:id])
---
SELECT "aspirants".* FROM "aspirants" WHERE "aspirants"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @aspirant = Aspirant.find(params[:id])
---
SELECT "aspirants".* FROM "aspirants" WHERE "aspirants"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @aspirant = Aspirant.new(params[:aspirant])

    respond_to do |format|
      if @aspirant.save
---
INSERT INTO "aspirants" ("aspirant_type", "created_at", "finish_date", "finish_study_date", "maybe_finish_date", "payment", "person_id", "protect_data", "protect_status", "rank", "scientman_id", "skip", "specialiti_id", "start_date", "start_study_date", "study_form", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @aspirant = Aspirant.find(params[:id])

    respond_to do |format|
      if @aspirant.update_attributes(params[:aspirant])
---
SELECT "aspirants".* FROM "aspirants" WHERE "aspirants"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "aspirants" SET "start_study_date" = '2011-09-01 00:00:00.000000', "updated_at" = '2012-02-08 15:09:06.005858', "maybe_finish_date" = '2013-05-30 00:00:00.000000' WHERE "aspirants"."id" = 1