app/controllers/chairs_controller.rb

  def index
    @chairs = Chair.all
---
SELECT "chairs".* FROM "chairs"

  def show
    @chair = Chair.find(params[:id])
---
SELECT "chairs".* FROM "chairs" WHERE "chairs"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @chair = Chair.find(params[:id])
---
SELECT "chairs".* FROM "chairs" WHERE "chairs"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @chair = Chair.new(params[:chair])

    respond_to do |format|
      if @chair.save
---
INSERT INTO "chairs" ("created_at", "name", "number", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 16 Feb 2012 11:35:33 UTC +00:00], ["name", "Бжд"], ["number", 124], ["updated_at", Thu, 16 Feb 2012 11:35:33 UTC +00:00]]