app/controllers/marks_controller.rb

SELECT "marks".* FROM "marks"
---
  def index
    @marks = Mark.all

SELECT "marks".* FROM "marks" WHERE "marks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @mark = Mark.find(params[:id])

SELECT "marks".* FROM "marks" WHERE "marks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @mark = Mark.find(params[:id])

INSERT INTO "marks" ("aspirant_id", "created_at", "subject_id", "updated_at", "value") VALUES (?, ?, ?, ?, ?)  [["aspirant_id", 1234], ["created_at", Thu, 12 Jan 2012 09:38:14 UTC +00:00], ["subject_id", 1234], ["updated_at", Thu, 12 Jan 2012 09:38:14 UTC +00:00], ["value", 5]]
---
  def create
    @mark = Mark.new(params[:mark])

    respond_to do |format|
      if @mark.save

SELECT "marks".* FROM "marks" WHERE "marks"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "marks" SET "updated_at" = '2012-02-08 15:05:54.346306', "subject_id" = 0, "value" = 3 WHERE "marks"."id" = 1
---
  def update
    @mark = Mark.find(params[:id])

    respond_to do |format|
      if @mark.update_attributes(params[:mark])