app/controllers/specialities_controller.rb

SELECT "specialities".* FROM "specialities"
---
  def index
    @specialities = Speciality.all

SELECT "specialities".* FROM "specialities" WHERE "specialities"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @speciality = Speciality.find(params[:id])

SELECT "specialities".* FROM "specialities" WHERE "specialities"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @speciality = Speciality.find(params[:id])

INSERT INTO "specialities" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 12 Jan 2012 10:21:13 UTC +00:00], ["name", "Информатика в экономике"], ["updated_at", Thu, 12 Jan 2012 10:21:13 UTC +00:00]]
---
  def create
    @speciality = Speciality.new(params[:speciality])

    respond_to do |format|
      if @speciality.save

SELECT "specialities".* FROM "specialities" WHERE "specialities"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy
    @speciality = Speciality.find(params[:id])