app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @subject = Subject.find(params[:id])

INSERT INTO "subjects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 14 Feb 2012 09:55:32 UTC +00:00], ["name", "Математика"], ["updated_at", Tue, 14 Feb 2012 09:55:32 UTC +00:00]]
---
  def create
    @subject = Subject.new(params[:subject])

    respond_to do |format|
      if @subject.save

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy
    @subject = Subject.find(params[:id])